//---------------------------------------------------------------------
//     直播源解析-【以下为各特定网站解析】依赖tv.js
//---------------------------------------------------------------------

//解析中国邮电大学直播导航页面内容
function loadYoudian(){
	/*
	 * 北京邮电大学（官方）：http://ivi.bupt.edu.cn/
	 */
	asyncApi('http://ivi.bupt.edu.cn/',function(msg){
		var list = msg.match(/<p>.*<\/p>\s+<a .*<\/a>&nbsp;\s+<a .* href="[^"]*".*>移动端<\/a>/g);
		var tv_list=[];
		for(var i=0;i<list.length;i++){
			var item=list[i].match(/<p>(.*)<\/p>\s+<a .*<\/a>&nbsp;\s+<a .* href="([^"]*)".*>移动端<\/a>/);
			var name=item[1];
			var m3u8_url = 'http://ivi.bupt.edu.cn'+item[2].replace('/n','').trim(); 
			tv_list.push({name:name,url:m3u8_url});
		}
		load(tv_list);
	},'html');	
}

//解析中国邮电大学直播导航页面内容
function loadCCTV(){
	//以下频道列表在该页面源码中获得 http://tv.cntv.cn/live/chongqing
     var chs = {'央视频道':[['cctv1','CCTV-1 综合','1','央视','央视频道','1'],['cctv2','CCTV-2 财经','1','央视','央视频道','2'],['cctv3','CCTV-3 综艺','1','央视','央视频道','3'],['cctv4','CCTV-4 (亚洲)','1','央视','央视频道','4'],['cctveurope','CCTV-4 (欧洲)','1','央视','央视频道','5'],['cctvamerica','CCTV-4 (美洲)','1','央视','央视频道','6'],['cctv5','CCTV-5 体育','1','央视','央视频道','7'],['cctv6','CCTV-6 电影','1','央视','央视频道','8'],['cctv7','CCTV-7 军事农业','1','央视','央视频道','9'],['cctv8','CCTV-8 电视剧','1','央视','央视频道','10'],['cctvjilu','CCTV-9 纪录','1','央视','央视频道','11'],['cctv10','CCTV-10 科教','1','央视','央视频道','13'],['cctv11','CCTV-11 戏曲','1','央视','央视频道','14'],['cctv12','CCTV-12 社会与法','1','央视','央视频道','15'],['cctv13','CCTV-13 新闻','1','央视','央视频道','16'],['cctvchild','CCTV-14 少儿','1','央视','央视频道','17'],['cctv15','CCTV-15 音乐','1','央视','央视频道','18'],['cctv5plus','CCTV体育赛事','1','北京','央视频道','24']],'卫视频道':[['anhui','安徽卫视','1','安徽','卫视频道','1'],['btv1','北京卫视','1','北京','卫视频道','2'],['bingtuan','兵团卫视','1','新疆','卫视频道','3'],['chongqing','重庆卫视','1','重庆','卫视频道','4'],['dongfang','东方卫视','1','上海','卫视频道','5'],['dongnan','东南卫视','1','福建','卫视频道','6'],['guangdong','广东卫视','1','广东','卫视频道','7'],['guangxi','广西卫视','1','广西','卫视频道','8'],['gansu','甘肃卫视','1','甘肃','卫视频道','9'],['guizhou','贵州卫视','1','贵州','卫视频道','10'],['hebei','河北卫视','1','河北','卫视频道','11'],['henan','河南卫视','1','河南','卫视频道','12'],['heilongjiang','黑龙江卫视','1','黑龙江','卫视频道','13'],['hubei','湖北卫视','1','湖北','卫视频道','14'],['jilin','吉林卫视','1','吉林','卫视频道','16'],['jiangxi','江西卫视','1','江西','卫视频道','18'],['liaoning','辽宁卫视','1','辽宁','卫视频道','20'],['travel','旅游卫视','1','海南','卫视频道','21'],['neimenggu','内蒙古卫视','1','内蒙古','卫视频道','22'],['ningxia','宁夏卫视','1','宁夏','卫视频道','23'],['qinghai','青海卫视','1','青海','卫视频道','24'],['shandong','山东卫视','1','山东','卫视频道','25'],['sdetv','山东教育台','1','山东','卫视频道','26'],['shenzhen','深圳卫视','1','广东','卫视频道','26'],['shan3xi','陕西卫视','1','陕西','卫视频道','27'],['shan1xi','山西卫视','1','山西','卫视频道','28'],['sichuan','四川卫视','1','四川','卫视频道','29'],['tianjin','天津卫视','1','天津','卫视频道','30'],['xizang','西藏卫视','1','西藏','卫视频道','31'],['xiamen','厦门卫视','1','福建','卫视频道','32'],['xinjiang','新疆卫视','1','新疆','卫视频道','33'],['xianggangweishi','香港卫视','0','香港','卫视频道','33'],['yanbian','延边卫视','1','吉林','卫视频道','34'],['yunnan','云南卫视','1','云南','卫视频道','35'],['hnss','三沙卫视','1','海南','卫视频道','1563']],'数字频道':[['zhongxuesheng','CCTV中学生','0','央视','数字频道','100001'],['cctvfxzl','CCTV发现之旅','1','央视','数字频道','36'],['xinkedongman','CCTV新科动漫','1','央视','数字频道','42'],['zhinan','CCTV电视指南','1','央视','数字频道','100002']],'城市频道':[['btv2','BTV文艺','1','北京','城市频道','401'],['btv3','BTV科教','1','北京','城市频道','402'],['btv4','BTV影视','1','北京','城市频道','403'],['btv5','BTV财经','1','北京','城市频道','404'],['btv6','BTV体育','1','北京','城市频道','405'],['btv7','BTV生活','1','北京','城市频道','406'],['btv8','BTV青少','1','北京','城市频道','407'],['btv9','BTV新闻','1','北京','城市频道','408'],['cztv1','潮州综合','0','广东','城市频道','701'],['cztv2','潮州公共','0','广东','城市频道','702'],['foshanxinwen','佛山新闻综合','0','广东','城市频道','703'],['shaoguanzonghe','韶关综合','0','广东','城市频道','709'],['zhuhaiyitao','珠海一套','1','广东','城市频道','712'],['zhuhaiertao','珠海二套','1','广东','城市频道','713'],['cdtv1','成都新闻综合','1','四川','城市频道','801'],['cdtv5','成都公共','1','四川','城市频道','803'],['hubeigonggong','湖北公共','0','湖北','城市频道','1102'],['hubeijiaoyu','湖北教育','0','湖北','城市频道','1103'],['hubeiyingshi','湖北影视','0','湖北','城市频道','1105'],['hubeijingshi','湖北经视','0','湖北','城市频道','1106'],['hubeigouwu','湖北购物','0','湖北','城市频道','1107'],['xiangyangtai','襄阳广播电视台','0','湖北','城市频道','1110'],['shijiazhuangsantao','石家庄三套','0','河北','城市频道','1405'],['nantongxinwen','南通新闻频道','0','江苏','城市频道','2002'],['nantongshejiao','南通社教频道','0','江苏','城市频道','2003'],['xiamen1','厦门一套','1','福建','城市频道','2301'],['xiamen2','厦门二套','1','福建','城市频道','2302'],['xiamen3','厦门三套','1','福建','城市频道','2303'],['xiamen4','厦门四套','1','福建','城市频道','2304'],['fyxw','阜阳新闻综合频道','0','安徽','城市频道','19560'],['fyds','阜阳都市频道','0','安徽','城市频道','19561'],['fygg','阜阳公共频道','0','安徽','城市频道','19562'],['fykj','阜阳教科农频道','0','安徽','城市频道','19563'],['tsbztv2','巴音郭勒蒙语频道','1','内蒙古','城市频道','100160'],['tsxjtv2','新疆维语综合频道','1','新疆','城市频道','122222'],['tsxjtv3','新疆哈语综合频道','1','新疆','城市频道','122223'],['tsxjtv5','新疆维语综艺频道','1','新疆','城市频道','122224'],['tsxjtv8','新疆哈语综艺频道','1','新疆','城市频道','122225'],['tsxjtv9','新疆维语经济生活频道','1','新疆','城市频道','122226'],['neimengwh','内蒙古文化频道','1','内蒙古','城市频道','1345678']]};
	var tv_list=[];
	for(ch in chs){
		for(c in chs[ch]){
			if(chs[ch][c][2] == '1'){
				tv_list.push({
					name:chs[ch][c][1],
					url: chs[ch][c][0],
					group_title:chs[ch][c][4],
					type:'byCCTV'
				});
			}
		}
	}
	load(tv_list);
}


//直接直播页
function loadIframe_Cietv_Com(tab='cctv5zaixianzhibo'){
	//[
	//	{desc:'cctv5zaixianzhibo',name:'央视频道'},
	//	{desc:'wangluodianshizhibo',name:'卫视频道'},
	//]
	asyncApi('http://www.cietv.com/'+tab,function(value){
		var parser=new DOMParser();
		var htmlDoc=parser.parseFromString(value, 'text/html');
		var text=$(htmlDoc).find('.play script').text();
		try{eval(text)}catch(err){}
		var src=eval('src');
		
		playByIframe(src);
		
	},'html')
}


